# Host: 127.0.0.1  (Version 5.6.24)
# Date: 2016-07-02 17:11:08
# Generator: MySQL-Front 5.3  (Build 5.39)

/*!40101 SET NAMES utf8 */;

#
# Structure for table "vip"
#

DROP TABLE IF EXISTS `vip`;
CREATE TABLE `vip` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `readCard` varchar(255) DEFAULT '',
  `name` varchar(255) DEFAULT '',
  `IDCard` varchar(255) DEFAULT '',
  `gender` varchar(255) DEFAULT '',
  `cardType` varchar(255) DEFAULT '',
  `addTime` date DEFAULT '1000-01-01',
  `status` varchar(255) DEFAULT '',
  `stuID` varchar(255) DEFAULT '',
  `deadLine` date DEFAULT '2100-12-31',
  `teachID` varchar(255) DEFAULT '',
  `teachClass` varchar(255) DEFAULT '',
  `tel` varchar(255) DEFAULT '',
  `qq` varchar(255) DEFAULT '',
  `email` varchar(255) DEFAULT '',
  `money` int(11) NOT NULL DEFAULT '0',
  `grade` varchar(255) NOT NULL DEFAULT '',
  `clazz` varchar(255) NOT NULL DEFAULT '',
  `school_id` int(11) DEFAULT '0',
  `operator` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=176 DEFAULT CHARSET=utf8;

#
# Data for table "vip"
#

INSERT INTO `vip` VALUES (165,'1','小明','33311122255588','女','学生','2016-04-04','有效','201505301346','2016-07-09','','','','','',1241,'一年级','一班',0,NULL),(166,'2','鹿旭东','112233445566','男','教师','2016-05-23','有效','','2100-12-31','201505050505','数学','17854160637','1014804721','1014804721@qq.com',144,'','',0,NULL),(167,'3','梁文革','123456789987654321','男','教师','2016-04-01','有效','','2100-12-31','123456','java课程设计','13154546565','1014804721','17854160637@163.com',0,'','',0,NULL),(168,'17888888','李子明','3715877845412345645','男','学生','2016-05-29','有效','20212123','2016-12-23','','','','','',0,'三年级','二班',0,NULL),(169,'88','向辉','1234567899876543121','男','教师','2016-01-28','有效','','2100-12-31','1248854654','计算机文化','17854564654','1013256464','01123121@1123,.com',0,'','',0,NULL),(170,'11111','史成周','185612345123','男','教师','2015-10-28','有效','','2100-12-31','12316565','英语','17854160637','1014804721','1014804721@qq.com',0,'','',0,NULL),(171,'23132522','尚洪海','122355996','男','教师','2015-06-02','有效','','2100-12-31','6654654','体育','17854160637','1014804721','1014804721@qq.com',0,'','',0,NULL),(172,'4656565','郝国祥','1231456789654321897','男','教师','2015-03-29','有效','','2100-12-31','1111111111111225','生活用药常识','17854160637','1014804721','1014804721@qq.com',0,'','',0,NULL),(174,'7411231564654','张勇','1234456789789','女','学生','2016-06-10','无效','123456789','2025-08-01','','','','','',0,'二年级','三班',0,NULL),(175,'11','11','11','男','学生','2016-06-27','有效','11','2016-07-30','','','','','',0,'一年级','一班',NULL,NULL);
